Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: The subdirectory is named with the first 2 characters of the SHA, and the filename is the remaining 38 characters.
es: La subcarpeta se nombra con los primeros 2 caracteres del SHA, y el archivo con los restantes 38 caracteres.

source: A branch in Git is simply a lightweight movable pointer to one of these commits.
es: Una rama Git es simplemente un apuntador móvil apuntando a una de esas confirmaciones.

source: ### Setting Up a User Account ###
es: ### Configurando una cuenta de usuario ###

source: Once again, this changes the SHAs of all the commits in your list, so make sure no commit shows up in that list that you’ve already pushed to a shared repository.
es: De nuevo, merece recalcar el hecho de que estas operaciones cambian los códigos SHA-1 de todas las confirmaciones de cambio afectadas. Y que, por tanto, no se deben hacer sobre confirmaciones de cambio enviadas(push) a algún repositorio compartido.

source: You’re taken to the Create a New Repository form (see Figure 4-5).
es: Irás al formulario de Crear un Nuevo Repositorio (ver Figura 4-5).

source: Then, run
es: Para luego lanzar

source: There, you can do a mixed reset of that commit with `git reset HEAD^`, which effectively undoes that commit and leaves the modified files unstaged.
es: En esta línea de comando, es donde se desharan los cambios tecleando el comando `git reset HEAD^` para dejar sin preparar (unstaged) los archivos cambiados.

source: The pre hooks can exit non-zero at any time to reject the push as well as print an error message back to the client; you can set up a push policy that’s as complex as you wish.
es: El script previo, puede terminar con un código de salida distinto de cero y abortar el envio, devolviendo el correspondiente mensaje de error al cliente. Este script puede implementar políticas de recepción tan complejas como desees.

source: You have to unstage the `rack` directory first.
es: Para evitarlo, se debe sacar la carpeta 'rack' del área de preparación.

source: Basic sequence of this managed-team workflow.
es: Secuencia básica de este flujo de trabajo en equipo gestionado.

source: You can also pipe it through the `tail` command because you’re only interested in the last few largest files:
es: Puedes también redirigir su salida a través del comando `tail`. Porque realmente solo nos interesan las últimas líneas, las correspondientes a los archivos más grandes.

source: Submodules allow you to keep a Git repository as a subdirectory of another Git repository.
es: Los submódulos permiten mantener un repositorio Git como una subcarpeta de otro repositorio Git.

source: When you’re thinking of integrating new work, it’s generally a good idea to try it out in a topic branch — a temporary branch specifically made to try out that new work.
es: Cuando estás pensando en integrar nuevo trabajo, suele ser buena idea utilizar una rama puntual para cada tema concreto --una rama temporal creada específicamente para trabajar dicho tema--

source: Now, Git will use the KDiff3 tool for diff viewing and merge conflict resolution.
es: A partir de ahora, Git utilizará la herramienta KDiff3 para mostrar y resolver conflictos de integración.

source: ## Branch Management ##
es: ## Gestión de ramificaciones ##

source: Insert 18333fig0504.png Figure 5-4.
es: Insert 18333fig0504.png Figura 5-4.

source: Jessica’s history after pushing all changes back to the server.
es: El historial de Jessica tras enviar de vuelta todos los cambios al servidor.

source: Git does this if you have too many loose objects around, if you run the `git gc` command manually, or if you push to a remote server.
es: Esto sucede cada vez que tiene demasiados objetos en formato "relajado"; o cuando tu invocas manualmente al comando `git gc`; o justo antes de enviar cualquier cosa a un servidor remoto.

source: This is useful if you have a number of commits on a topic branch and you want to integrate only one of them, or if you only have one commit on a topic branch and you’d prefer to cherry-pick it rather than run rebase.
es: Puede ser util si tienes varias confirmaciones de cambios en una rama puntual, y tan solo deseas integar una de ellas; o si tienes una única confirmación de cambios en una rama puntual, y prefieres entresacarla en lugar de reorganizar.

source: Because the repository is only used as a collaboration point, there is no reason to have a snapshot checked out on disk; it’s just the Git data.
es: Debido a que dicho repositorio se va a utilizar exclusivamente como un punto de colaboración, no tiene sentido el tener una instantánea de trabajo (snapshot) activa en el disco (checkout); nos basta con tener solamente los propios datos Git.

source: In this next scenario, you’ll look at contributor roles in a larger private group.
es: En este próximo escenario, vamos a hechar un vistazo al rol de colaborador en un gran grupo privado.

source: It will also use these values to help you when you apply patches with `git apply`.
es: También pueden ser útiles estos ajustes cuando estás incorporando parches con 'git apply'.

source: Many times, when working with Git, you may want to revise your commit history for some reason.
es: Por razones varias, hay ocasiones en que se desea revisar el historial de confirmaciones de cambio.

source: Does it even have a policy?
es: Es más, ¿tiene un sistema para ello?.

source: ### Pushing ###
es: ### Publicando ###

source: It’s also important to mention that this isn’t necessarily the fastest option if you’re using a shared mount of some kind.
es: Cabe destacar también que una carpeta compartida no es precisamente la opción más rápida.

source: This is the beginning of the output of the format-patch command that you saw in the previous section.
es: Esto es el comienzo de la salida del comando format-patch visto en la sección anterior.

source: To see reflog information formatted like the `git log` output, you can run `git log -g`:
es: Si se desea ver la información del registro de referencia, formateada de forma similar a la salida del comando 'git log', se puede lanzar el comando 'git log -g':

source: When you have work in a topic branch and have determined that you want to integrate it, you move to that branch and run the rebase command to rebuild the changes on top of your current master (or `develop`, and so on) branch.
es: Cuando desees integrar el trabajo que tienes en una rama puntual, te puedes situar sobre ella y lanzar el comando 'rebase'; de esta forma recompondrás los cambios encima de tu actual rama 'master' (o 'develop' o lo que corresponda).

source: $regex = /\[ref: (\d+)\]/
es: $regex = /\[ref: (\d+)\]/$regex = /\[ref: (\d+)\]/

source: At the bottom, you should find a line that looks something like this:
es: Localizar, al fondo, una línea parecida a:

source: You get a reference to teamone’s master branch position locally.
es: Obtienes una referencia local a la posición en la rama 'master' de 'teamone'.

source: This is something you’ve likely never done with a VCS before because it’s generally too expensive to create and merge branches.
es: Es algo que nunca habrías hecho en otro sistema VCS, debido a los altos costos de crear y fusionar ramas que se suelen dar en esos sistemas.

source: You can run `git status` again to verify that all conflicts have been resolved:
es: En cualquier momento, puedes lanzar el comando 'git status' para ver si ya has resuelto todos los conflictos:

source: Instead of forking the project and pushing to your own writable version, you generate e-mail versions of each commit series and e-mail them to the developer mailing list:
es: En lugar de bifurcar (fork) el proyecto y enviar a tu propia copia editable, generarás correos electrónicos para cada serie de parches y os enviarás a la lista de correo.

source: If you do have that commit — if the patch was based on a public commit — then the `-3` option is generally much smarter about applying a conflicting patch:
es: Sin embargo, si tienes dicha confirmación de cambios (commit), --si el parche está basado en una confirmación pública--, entonces la opción '-3' suele ser mucho más avispada cuando incorporas un parche conflictivo:

source: The client-side hooks are for client operations such as committing and merging.
es: Los puntos del lado cliente están relacionados con operaciones tales como la confirmación de cambios (commit) o la fusión (merge).

source: However, there is another way: you can take the patch of the change that was introduced in C3 and reapply it on top of C4.
es: Aunque también hay otra forma de hacerlo: puedes coger los cambios introducidos en C3 y reaplicarlos encima de C4.

source: However, it can be very useful.
es: De todas formas, allá donde sea aplicable, puede ser de gran utilidad.

source: When you restart your machine, your Git daemon will start automatically and respawn if it goes down.
es: Tras reiniciar tu máquina, el demonio Git arrancará automáticamente y se reiniciará cuando se caiga.

source: This rewrites your history to now look like Figure 5-17.
es: Esto reescribe tu historial, quedando como se vé en la Figura 5-17.

source: This also refers to the first parent, so `HEAD~` and `HEAD^` are equivalent.
es: Utilizada tal cual, también se refiere al padre. Por lo tanto, `HEAD~` y `HEAD^` son equivalentes.

source: If you already have a shared filesystem to which your whole team has access, setting up a repository is very easy.
es: Si tienes un sistema de archivo compartido que todo el equipo pueda usar, preparar un repositorio es muy sencillo.

source: However, if someone at any point in the history of your project added a single huge file, every clone for all time will be forced to download that large file, even if it was removed from the project in the very next commit.
es: Pero, si alguien, en cualquier momento de tu proyecto, ha añadido un solo archivo enorme. A partir de ese momento, todos los clones, siempre, se verán obligados a copiar ese enorme archivo. Incluso si ya ha sido borrado del proyecto en la siguiente confirmación de cambios realizada inmediatamente tras la que lo añadió.

source: You fetch them and merge the new remote branch into your work, making your history look something like Figure 3-37.
es: Tu te traes (fetch) sus trabajos y los fusionas (merge) sobre una nueva rama en tu trabajo. Quedando tu registro de confirmaciones como en la Figura 3-37.

source: #### Making a Subdirectory the New Root ####
es: #### Haciendo que una subcarpeta sea la nueva carpeta raiz ####

source: Now you’re ready to collaborate on the same project.
es: Ahora ya estás preparado para trabajar con ellos en el proyecto común.

source: Single commit repository data.
es: Datos en el repositorio tras una confirmación sencilla.

source: First you run `git bisect start` to get things going, and then you use `git bisect bad` to tell the system that the current commit you’re on is broken.
es: Primero se lanza el comando `git bisect start` para iniciar el proceso de búsqueda. Luego, con el comando `git bisect bad`, se le indica al sistema cual es la confirmación de cambios a partir de donde se han detectado los problemas.

source: The other thing `gc` will do is pack up your references into a single file.
es: Otra tarea realizada por `gc` es el empaquetar referencias en un solo archivo.

source: This lets the user with that key modify the main Git repository that controls the Gitosis setup.
es: Esto habilita al usuario con dicha clave pública para que pueda modificar el repositorio principal de Git, y, con ello, pueda controlar la instalación de Gitosis.

source: It’s worth noting here that the work you did in your `hotfix` branch is not contained in the files in your `iss53` branch.
es: Cabe indicar que todo el trabajo realizado en la rama 'hotfix' no está en los archivos de la rama 'iss53'.

source: Next, John e-mails Jessica to say he’s pushed some changes to the `featureA` branch and ask her to verify them.
es: A continuación, John envia un correo-e a jessica comentandole que ha enviado algunos cambios a la rama 'featureA' y pidiendole que los verifique.

source: If that script is in place (in `.git/hooks/commit-msg`) and executable, and you commit with a message that isn’t properly formatted, you see this:
es: Si este script está en su sitio (el archivo '.git/hooks/commit-msg') y es ejecutable, al confirmar cambios con un mensaje inapropiado, verás algo asi como:

source: However, you should be aware of how ridiculously unlikely this scenario is.
es: No obstante, hemos de ser conscientes de lo altamente improbable de un suceso así.

source: #### The Pros ####
es: ### Ventajas ###

source: Or you can use the shorter scp-like syntax for SSH protocol: $ git clone user@server:project.git
es: O puedes prescindir del protocolo; Git asume SSH si no indicas nada expresamente: $ git clone user@server:project.git

source: They will be told that they’re trying to push non-fast-forward changes and that they won’t be able to do so until they fetch and merge.
es: El sistema le avisará de que está intentando enviar (push) cambios no directos (non-fast-forward changes), y de que no podrá hacerlo hasta que recupere (fetch) y fusione (merge) los cambios preexistentes.

source: After it’s tested, merge the hotfix branch, and push to production.
es: Tras las pertinentes pruebas, fusionas (merge) esa rama y la envias (push) a la rama de producción.

source: ### Public Small Project ###
es: ### Pequeño Proyecto Público ###

source: No `-w` option is needed — calling `write-tree` automatically creates a tree object from the state of the index if that tree doesn’t yet exist:
es: Sin necesidad de la opción `-w`, solo llamando al comando `write-tree`, y si dicho árbol no existiera ya, se crea automáticamente un objeto tipo árbol a partir del estado del índice.

source: When that is set up, you can use `git send-email` to place the patch series in the Drafts folder of the specified IMAP server:
es: Cuando tengas esto ajustado, podrás utilizar el comando `git send-email` para poner series de parches en la carpeta de borradores (Drafts) de tu servidor IMAP:

source: If you were working on an issue with a partner and they pushed up an `iss53` branch, you might have your own local `iss53` branch; but the branch on the server would point to the commit at `origin/iss53`.
es: O si estás trabajando en un problema con un compañero y este envia (push) una rama 'iss53', tu tendrás tu propia rama de trabajo local 'iss53'; pero la rama en el servidor apuntará a la última confirmación (commit) en la rama 'origin/iss53'.

source: It will start at the commit you specify on the command line (`HEAD~3`) and replay the changes introduced in each of these commits from top to bottom.
es: Un script que, comenzando por la confirmación de cambios indicada en la línea del comando (`HEAD~3`), va a reaplicar los cambios introducidos en cada una de las confirmaciones, desde arriba hasta abajo.

source: You also have access to the user doing the pushing if the push is being run over SSH.
es: También puedes tener acceso al usuario que está enviando, si este los envia a través de SSH.

source: Insert 18333fig0511.png Figure 5-11.
es: Insert 18333fig0511.png Figura 5-11.

source: 2^80 is 1.2 x 10^24 or 1 million billion billion.
es: 2^80 es 1'2 x 10^24, o lo que es lo mismo, 1 billón de billones.

source: Staging the file marks it as resolved in Git.
es: Marcar archivos como preparados (staging), indica a Git que sus conflictos han sido resueltos.

source: This can involve changing the order of the commits, changing messages or modifying files in a commit, squashing together or splitting apart commits, or removing commits entirely — all before you share your work with others.
es: Así, es posible cambiar el orden de las confirmaciones, cambiar sus mensajes, modificar los archivos comprendidos en ellas, juntar varias confirmaciones en una sola, partir una en varias,o incluso borrar alguna completamente. --Aunque todo ello es siempre recomendable hacerlo solo antes de compartir nuestro trabajo con otros.--

source: Insert 18333fig0315.png Figure 3-15.
es: Insert 18333fig0315.png Figura 3-15.

source: Now, when you run git archive to create a tarball of your project, that directory won’t be included in the archive.
es: A partir de ese momento, cada vez que lances el comando 'git archive' para crear un archivo comprimido de tu proyecto, esa carpeta no se incluirá en él.

source: One caveat is that it expects you to be running locally as the same user you push as to the remote machine.
es: Es necesario advertir de que se espera que trabajes localmente con el mismo usuario con el que enviarás (push) a la máquina remota.

source: The Wiki tab provides a wiki where you can write documentation or other information about your project.
es: La pestaña "Wiki" enlaza con un espacio wiki donde puedes escribir documentación o cualquier otra información relevante sobre tu proyecto.

source: If you have an existing public Subversion project that you want to import into Git, GitHub can often do that for you.
es: Si tienes un proyecto público Subversion que deseas pasar a Git, GitHub suele poder realizar la importación.

source: The other files are your new packfile and an index.
es: Los otros archivos presentes son el nuevo archivo empaquetador y un índice.

source: You merge in the same work again into a new merge commit.
es: Vuelves a fusionar el mismo trabajo en una nueva fusión confirmada.

source: If you need to revoke access to individuals, you can click the "revoke" link, and their push access will be removed.
es: Si deseas revocar el acceso a alguno de ellos, puedes clicar sobre el enlace "revoke", y sus permisos de envio (push) serán revocados.

source: All of these fields are delimited by a pipe (`|`) character.
es: Cada uno de esos campos se separan entre sí con el caracter barra vertical ('|').

source: You can see Chapter 9 for more information about plumbing tools; basically, `rev-parse` exists for lower-level operations and isn’t designed to be used in day-to-day operations.
es: En el capítulo 9 se verá más información sobre las herramientas de fontaneria. Herramientas estas que son utilizadas para operaciones a muy bajo nivel, y que no estan pensadas para ser utilizadas en el trabajo habitual del día a día.

source: Insert 18333fig0401.png Figure 4-1.
es: Insert 18333fig0401.png Figura 4-1.

source: ### Changing Multiple Commit Messages ###
es: ### Modificar múltiples confirmaciones de cambios ###

source: ### Preparing a Release ###
es: ### Preparando un lanzamiento de versión ###

source: This section outlines the various ways you can refer to a single commit.
es: En esta sección se verán las diversas formas existentes para referirse a una determinada confirmación de cambios (commit).

source: It lists the changes you’ve staged on the left and unstaged changes on the right.
es: Se ve una lista de cambios ya preparados, en la izquierda; y de los que están aún sin preparar, en la derecha.

source: Git transport over HTTP is often referred to as the dumb protocol because it requires no Git-specific code on the server side during the transport process.
es: El transporte de Git sobre protocolo HTTP es conocido también como protocolo tonto. Porque no requiere ningún tipo de codigo Git en la parte servidor.

source: One Rubyism that may not be clear is `path.index(access_path) == 0`, which is true if path begins with `access_path` — this ensures that `access_path` is not just in one of the allowed paths, but an allowed path begins with each accessed path.
es: Un "rubysmo" que posiblemente sea un tanto oscuro puede ser 'path.index(access_path) == 0' . Simplemente devuelve verdadero en el caso de que la ubicacion comience por 'access_path' ; de esta forma, nos aseguramos de que 'access_path' no esté solo contenido en una de las ubicaciones permitidas, sino sea una ubicación permitida la que comience con la ubicación accedida.

source: This is shorthand for:
es: Esto es un atajo a:

source: You get an object back — that object is in loose format on the server, and you fetched it over a static HTTP GET request.
es: Cuando recuperas un objeto, dicho objeto se encuentra suelto (loose) en el servidor y lo traes mediante una petición estática HTTP GET.

source: remote: Compressing objects: 100% (1465/1465), done.
es: remote: Compressing objects: 100% (1465/1465), done.remote: Compressing objects: 100% (1465/1465), done.

source: For instance, if you want the iphone project to show up on GitWeb, you make the `repo` setting look like this:
es: Por ejemplo, si quieres mostrar el proyecto iphone, has de poner algo así como:

source: ### Creating a New Repository ###
es: ### Creando un nuevo repositorio ###

source: Typing `?` shows a list of what you can do:
es: Tecleando '?' se muestra una lista de las mismas:

source: If you want to allow anonymous read-only access to your projects, you’ll have to set up SSH for you to push over but something else for others to pull over.
es: Pero si quieres también habilitar accesos anónimos de solo lectura, tendrás que reservar SSH para tus envios (push) y habilitar algún otro protocolo para las recuperaciones (pull) de los demás.

source: When you save and exit the editor, Git applies all three changes and then puts you back into the editor to merge the three commit messages:
es: Cuando se guarde y salga en el editor, Git rebobinará la historia, reaplicará las tres confirmaciones de cambio, y volverá al editor para fusionar también los mensajes de esas tres confirmaciones.

source: Doing so will allow pushes from their public keys to work.
es: De esta forma, funcionarán los envios (push) desde sus respectivas claves públicas.

source: If you set `help.autocorrect` to 1, Git will automatically run the command if it has only one match under this scenario.
es: Si ajustas 'help.autocorrect' a 1, Git lanzará automáticamente el comando corregido, (pero solo cuando haya únicamente uno que pueda encajar).

source: Finally, you went back to your server branch and did a few more commits.
es: Por último, vuelves sobre la rama 'server' y haces algunos cambios más.

source: Instead of "I added tests for" or "Adding tests for," use "Add tests for." Here is a template originally written by Tim Pope at tpope.net:
es: Por ejemplo, en vez de escribir "He añadido comprobaciones para" o "Añadiendo comprobaciones para", utilizar la frase "Añadir comprobaciones para". Como plantilla de referencia, podemos utilizar la que escribió Tim Pope en tpope.net:

source: Some files look like text files but for all intents and purposes are to be treated as binary data.
es: Algunos archivos aparentan ser textuales, pero a efectos prácticos merece más la pena tratarlos como binarios.

source: The first variable is active contributor size.
es: La primera variable es el número de colaboradores activos.

source: When you want to share a branch with the world, you need to push it up to a remote that you have write access to.
es: Cuando quieres compartir una rama con el resto del mundo, has de llevarla (push) a un remoto donde tengas permisos de escritura.

source: Insert 18333fig0334.png Figure 3-34.
es: Insert 18333fig0334.png Figura 3-34.

source: Note that the snapshot pointed to by the final commit you end up with, whether it’s the last of the rebased commits for a rebase or the final merge commit after a merge, is the same snapshot — it’s only the history that is different.
es: Cabe destacar que la instantánea (snapshot) apuntada por la confirmación (commit) final, tanto si es producto de una regorganización (rebase) como si lo es de una fusión (merge), es exactamente la misma instantánea. Lo único diferente es el registro.

source: What does this `post-update` hook do?
es: ¿Que hace este anclaje 'post-update'?
